resources/xmlfiles/taxlink/po-createApInvoiceMatchedPo240charsdescription.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.vertexinc.com/vertextl/taxIntegration/types/">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:MessageID>uuid:be29d495-73ff-4610-abed-1c4dae78b117</wsa:MessageID>
		<wsa:Action>calculation</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<typ:calculation>
			<typ:trxHeader>
				<typ:ApplicationId>201</typ:ApplicationId>
				<typ:ApplicationShortname>PO</typ:ApplicationShortname>
				<typ:DefaultTaxationCountry>US</typ:DefaultTaxationCountry>
				<typ:DocEventStatus>DISTRIBUTED</typ:DocEventStatus>
				<typ:EntityCode>PURCHASE_ORDER</typ:EntityCode>
				<typ:EventClassCode>PO_PA</typ:EventClassCode>
				<typ:EstablishmentId>300000001140074</typ:EstablishmentId>
				<typ:EstablishmentNumber>1010</typ:EstablishmentNumber>
				<typ:EventClassMappingId>3</typ:EventClassMappingId>
				<typ:EventTypeCode>PO_PA_DISTRIBUTED</typ:EventTypeCode>
				<typ:EndPointUrl>https://ecog-test.fa.us2.oraclecloud.com</typ:EndPointUrl>
				<typ:FirstPtyOrgId>300000004221936</typ:FirstPtyOrgId>
				<typ:HdrTrxUserKey1>CALCULATE</typ:HdrTrxUserKey1>
				<typ:HqEstbPartyTaxProfId>300000001140233</typ:HqEstbPartyTaxProfId>
				<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
				<typ:LedgerId>300000001139008</typ:LedgerId>
				<typ:LegalEntityId>300000001140056</typ:LegalEntityId>
				<typ:LegalEntityNumber>RIUS108111</typ:LegalEntityNumber>
				<typ:LogLevel>SEVERE</typ:LogLevel>
				<typ:TrxCurrencyCode>USD</typ:TrxCurrencyCode>
				<typ:TrxDate>2022-10-10</typ:TrxDate>
				<typ:TrxId>364321</typ:TrxId>
				<typ:TrxLevelType>ITEM</typ:TrxLevelType>
				<typ:TrxNumber>AUTOTST_POAPINVOICEMATCHEDCREATE240CHARSDESC_2462</typ:TrxNumber>
			</typ:trxHeader>
			<typ:trxLineList>
				<typ:trxLine>
					<typ:AccountCcid>300000005572524</typ:AccountCcid>
					<typ:ApplicationId>201</typ:ApplicationId>
					<typ:AccountString>3211-20-60041-110-0000-0000</typ:AccountString>
					<typ:AccrueOnReceiptFlag>Y</typ:AccrueOnReceiptFlag>
					<typ:AssessableValue>100</typ:AssessableValue>
					<typ:BillFromGeographyType1>ADDRESS1</typ:BillFromGeographyType1>
					<typ:BillFromGeographyType10>PROVINCE</typ:BillFromGeographyType10>
					<typ:BillFromGeographyType2>ADDRESS2</typ:BillFromGeographyType2>
					<typ:BillFromGeographyType3>ADDRESS3</typ:BillFromGeographyType3>
					<typ:BillFromGeographyType4>ADDRESS4</typ:BillFromGeographyType4>
					<typ:BillFromGeographyType5>COUNTRY</typ:BillFromGeographyType5>
					<typ:BillFromGeographyType6>STATE</typ:BillFromGeographyType6>
					<typ:BillFromGeographyType7>COUNTY</typ:BillFromGeographyType7>
					<typ:BillFromGeographyType8>CITY</typ:BillFromGeographyType8>
					<typ:BillFromGeographyType9>POSTALCODE</typ:BillFromGeographyType9>
					<typ:BillFromGeographyValue1>5600 Independence Ave</typ:BillFromGeographyValue1>
					<typ:BillFromGeographyValue2>Suite 100</typ:BillFromGeographyValue2>
					<typ:BillFromGeographyValue5>US</typ:BillFromGeographyValue5>
					<typ:BillFromGeographyValue6>California</typ:BillFromGeographyValue6>
					<typ:BillFromGeographyValue7>Fresno</typ:BillFromGeographyValue7>
					<typ:BillFromGeographyValue8>Fresno</typ:BillFromGeographyValue8>
					<typ:BillFromGeographyValue9>93650</typ:BillFromGeographyValue9>
					<typ:BillFromLocationId>300000004277754</typ:BillFromLocationId>
					<typ:BillFromPartyName>MCC Calif</typ:BillFromPartyName>
					<typ:BillFromPartyNumber>11011</typ:BillFromPartyNumber>
					<typ:BillThirdPtyAcctId>300000004277749</typ:BillThirdPtyAcctId>
					<typ:BillThirdPtyAcctSiteId>300000004277762</typ:BillThirdPtyAcctSiteId>
					<typ:BillToGeographyType1>ADDRESS1</typ:BillToGeographyType1>
					<typ:BillToGeographyType10>PROVINCE</typ:BillToGeographyType10>
					<typ:BillToGeographyType2>ADDRESS2</typ:BillToGeographyType2>
					<typ:BillToGeographyType3>ADDRESS3</typ:BillToGeographyType3>
					<typ:BillToGeographyType4>ADDRESS4</typ:BillToGeographyType4>
					<typ:BillToGeographyType5>COUNTRY</typ:BillToGeographyType5>
					<typ:BillToGeographyType6>STATE</typ:BillToGeographyType6>
					<typ:BillToGeographyType7>COUNTY</typ:BillToGeographyType7>
					<typ:BillToGeographyType8>CITY</typ:BillToGeographyType8>
					<typ:BillToGeographyType9>POSTALCODE</typ:BillToGeographyType9>
					<typ:BillToGeographyValue1>5430 One Shields Avenue</typ:BillToGeographyValue1>
					<typ:BillToGeographyValue5>US</typ:BillToGeographyValue5>
					<typ:BillToGeographyValue6>Pennsylvania</typ:BillToGeographyValue6>
					<typ:BillToGeographyValue8>Berwyn</typ:BillToGeographyValue8>
					<typ:BillToGeographyValue9>19312</typ:BillToGeographyValue9>
					<typ:BillToLocationId>300000001141673</typ:BillToLocationId>
					<typ:DestinationTypeCode>EXPENSE</typ:DestinationTypeCode>
					<typ:EntityCode>PURCHASE_ORDER</typ:EntityCode>
					<typ:EventClassCode>PO_PA</typ:EventClassCode>
					<typ:LineAmt>100</typ:LineAmt>
					<typ:LineAmtIncludesTaxFlag>S</typ:LineAmtIncludesTaxFlag>
					<typ:LineClass>AMOUNT_MATCHED</typ:LineClass>
					<typ:LineLevelAction>CREATE</typ:LineLevelAction>
					<typ:LineTrxUserKey1>1</typ:LineTrxUserKey1>
					<typ:LineTrxUserKey2>VTX_PA</typ:LineTrxUserKey2>
					<typ:LineTrxUserKey3>0</typ:LineTrxUserKey3>
					<typ:LinesDetFactorId>6417495</typ:LinesDetFactorId>
					<typ:Precision>2</typ:Precision>
					<typ:ProductDescription>xL8q1abcuD9VZZ9nI7sq4jqbPGzLWow2K2V3BuF8g6s1JK*!n4+Xb4yk6aa1FnZ3gfAHJqh4zP4QR9Gb?_H4s3xcFXb98Ofa895ZSWCNA9kkq39I8YD0gnriGqOKa3GF918Xh5GkUH6QXI4zAnh92b2nn8GYY074z37SkSxj28dwnv5s64G69sMVCy4rB8RG79R06Ob5L8h2T2pd5W9w8O767IdH9q135KgGjB1Y3Vm32y7F</typ:ProductDescription>
					<typ:ProductOrgId>300000006755545</typ:ProductOrgId>
					<typ:ProductType>SERVICES</typ:ProductType>
					<typ:PurchaseBasis>SERVICES</typ:PurchaseBasis>
					<typ:PurchasingCategoryId>300000004105670</typ:PurchasingCategoryId>
					<typ:ShipFromGeographyType1>ADDRESS1</typ:ShipFromGeographyType1>
					<typ:ShipFromGeographyType10>PROVINCE</typ:ShipFromGeographyType10>
					<typ:ShipFromGeographyType2>ADDRESS2</typ:ShipFromGeographyType2>
					<typ:ShipFromGeographyType3>ADDRESS3</typ:ShipFromGeographyType3>
					<typ:ShipFromGeographyType4>ADDRESS4</typ:ShipFromGeographyType4>
					<typ:ShipFromGeographyType5>COUNTRY</typ:ShipFromGeographyType5>
					<typ:ShipFromGeographyType6>STATE</typ:ShipFromGeographyType6>
					<typ:ShipFromGeographyType7>COUNTY</typ:ShipFromGeographyType7>
					<typ:ShipFromGeographyType8>CITY</typ:ShipFromGeographyType8>
					<typ:ShipFromGeographyType9>POSTALCODE</typ:ShipFromGeographyType9>
					<typ:ShipFromGeographyValue1>5600 Independence Ave</typ:ShipFromGeographyValue1>
					<typ:ShipFromGeographyValue2>Suite 100</typ:ShipFromGeographyValue2>
					<typ:ShipFromGeographyValue5>US</typ:ShipFromGeographyValue5>
					<typ:ShipFromGeographyValue6>California</typ:ShipFromGeographyValue6>
					<typ:ShipFromGeographyValue7>Fresno</typ:ShipFromGeographyValue7>
					<typ:ShipFromGeographyValue8>Fresno</typ:ShipFromGeographyValue8>
					<typ:ShipFromGeographyValue9>93650</typ:ShipFromGeographyValue9>
					<typ:ShipFromLocationId>300000004277754</typ:ShipFromLocationId>
					<typ:ShipFromPartyName>MCC Calif</typ:ShipFromPartyName>
					<typ:ShipFromPartyNumber>11011</typ:ShipFromPartyNumber>
					<typ:ShipThirdPtyAcctId>300000004277749</typ:ShipThirdPtyAcctId>
					<typ:ShipThirdPtyAcctSiteId>300000004277762</typ:ShipThirdPtyAcctSiteId>
					<typ:ShipToGeographyType1>ADDRESS1</typ:ShipToGeographyType1>
					<typ:ShipToGeographyType10>PROVINCE</typ:ShipToGeographyType10>
					<typ:ShipToGeographyType2>ADDRESS2</typ:ShipToGeographyType2>
					<typ:ShipToGeographyType3>ADDRESS3</typ:ShipToGeographyType3>
					<typ:ShipToGeographyType4>ADDRESS4</typ:ShipToGeographyType4>
					<typ:ShipToGeographyType5>COUNTRY</typ:ShipToGeographyType5>
					<typ:ShipToGeographyType6>STATE</typ:ShipToGeographyType6>
					<typ:ShipToGeographyType7>COUNTY</typ:ShipToGeographyType7>
					<typ:ShipToGeographyType8>CITY</typ:ShipToGeographyType8>
					<typ:ShipToGeographyType9>POSTALCODE</typ:ShipToGeographyType9>
					<typ:ShipToGeographyValue1>852 Penn Park</typ:ShipToGeographyValue1>
					<typ:ShipToGeographyValue5>US</typ:ShipToGeographyValue5>
					<typ:ShipToGeographyValue6>Pennsylvania</typ:ShipToGeographyValue6>
					<typ:ShipToGeographyValue7>Chester</typ:ShipToGeographyValue7>
					<typ:ShipToGeographyValue8>Exton</typ:ShipToGeographyValue8>
					<typ:ShipToGeographyValue9>19341</typ:ShipToGeographyValue9>
					<typ:ShipToLocationId>300000006692952</typ:ShipToLocationId>
					<typ:TaxProcessingCompletedFlag>Y</typ:TaxProcessingCompletedFlag>
					<typ:TaxReportingFlag>N</typ:TaxReportingFlag>
					<typ:TrxBusinessCategory>PURCHASE_TRANSACTION</typ:TrxBusinessCategory>
					<typ:TrxCommunicatedDate>2022-10-10</typ:TrxCommunicatedDate>
					<typ:TrxId>364321</typ:TrxId>
					<typ:TrxLineCurrencyCode>USD</typ:TrxLineCurrencyCode>
					<typ:TrxLineDate>2022-10-10</typ:TrxLineDate>
					<typ:TrxLineDescription>xL8q1abcuD9VZZ9nI7sq4jqbPGzLWow2K2V3BuF8g6s1JK*!n4+Xb4yk6aa1FnZ3gfAHJqh4zP4QR9Gb?_H4s3xcFXb98Ofa895ZSWCNA9kkq39I8YD0gnriGqOKa3GF918Xh5GkUH6QXI4zAnh92b2nn8GYY074z37SkSxj28dwnv5s64G69sMVCy4rB8RG79R06Ob5L8h2T2pd5W9w8O767IdH9q135KgGjB1Y3Vm32y7F</typ:TrxLineDescription>
					<typ:TrxLineId>300000030937741</typ:TrxLineId>
					<typ:TrxLineNumber>1</typ:TrxLineNumber>
					<typ:TrxLinePrecision>2</typ:TrxLinePrecision>
					<typ:TrxLineType>ITEM</typ:TrxLineType>
					<typ:TrxLevelType>SHIPMENT</typ:TrxLevelType>
					<typ:PoNumber>16705</typ:PoNumber>
					<typ:VendorTypeLookupCode>SUPPLIER</typ:VendorTypeLookupCode>
					<typ:VendorNumber>10021</typ:VendorNumber>
				</typ:trxLine>
			</typ:trxLineList>
			<typ:trxDetailTaxLineList>
				<typ:trxDetailTaxLine>
					<typ:ApplicationId>201</typ:ApplicationId>
					<typ:Attribute11>CONSUMERS_USE|Sales and Use Tax|General Sales and Use Tax</typ:Attribute11>
					<typ:Attribute12>ADDHERE||||</typ:Attribute12>
					<typ:Attribute13>PENNSYLVANIA</typ:Attribute13>
					<typ:Attribute14>TAXABLE|DEFAULT||SINGLE_RATE|||||||F</typ:Attribute14>
					<typ:Attribute15>RIUS108111|6.0|ZEROCHARGED|PAYCALCULATED||0||6.0||</typ:Attribute15>
					<typ:CancelFlag>N</typ:CancelFlag>
					<typ:CompoundingTaxFlag>N</typ:CompoundingTaxFlag>
					<typ:CopiedFromOtherDocFlag>N</typ:CopiedFromOtherDocFlag>
					<typ:DeleteFlag>N</typ:DeleteFlag>
					<typ:EntityCode>PURCHASE_ORDER</typ:EntityCode>
					<typ:EventClassCode>PO_PA</typ:EventClassCode>
					<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
					<typ:LedgerId>300000001139008</typ:LedgerId>
					<typ:LegalEntityId>300000001140056</typ:LegalEntityId>
					<typ:LegalMessageAppl2>300000030937744</typ:LegalMessageAppl2>
					<typ:LegalMessageBasis>300000030937745</typ:LegalMessageBasis>
					<typ:LegalMessageCalc>300000030937746</typ:LegalMessageCalc>
					<typ:LegalMessageExcpt>300000030937747</typ:LegalMessageExcpt>
					<typ:LegalMessageExmpt>300000030937748</typ:LegalMessageExmpt>
					<typ:LegalMessagePos>300000030937749</typ:LegalMessagePos>
					<typ:LegalMessageStatus>300000030937751</typ:LegalMessageStatus>
					<typ:LegalMessageRate>300000030937750</typ:LegalMessageRate>
					<typ:LegalMessageThreshold>300000030937752</typ:LegalMessageThreshold>
					<typ:LegalReportingStatus>000000000000000</typ:LegalReportingStatus>
					<typ:LineAmt>100</typ:LineAmt>
					<typ:LineAssessableValue>100</typ:LineAssessableValue>
					<typ:ManuallyEnteredFlag>N</typ:ManuallyEnteredFlag>
					<typ:OffsetFlag>N</typ:OffsetFlag>
					<typ:OverriddenFlag>N</typ:OverriddenFlag>
					<typ:Precision>2</typ:Precision>
					<typ:ReportableFlag>N</typ:ReportableFlag>
					<typ:ReportingOnlyFlag>N</typ:ReportingOnlyFlag>
					<typ:RoundingRuleCode>NEAREST</typ:RoundingRuleCode>
					<typ:SelfAssessedFlag>N</typ:SelfAssessedFlag>
					<typ:Tax>VERTEX TAX</typ:Tax>
					<typ:TaxAmt>6</typ:TaxAmt>
					<typ:TaxAmtIncludedFlag>N</typ:TaxAmtIncludedFlag>
					<typ:TaxAmtTaxCurr>6</typ:TaxAmtTaxCurr>
					<typ:TaxApportionmentLineNumber>1</typ:TaxApportionmentLineNumber>
					<typ:TaxCurrencyCode>USD</typ:TaxCurrencyCode>
					<typ:TaxCurrencyConversionRate>1</typ:TaxCurrencyConversionRate>
					<typ:TaxDate>2022-10-10</typ:TaxDate>
					<typ:TaxDetermineDate>2022-10-10</typ:TaxDetermineDate>
					<typ:TaxJurisdictionCode>VTX_VERTEX_TAX_JURCD</typ:TaxJurisdictionCode>
					<typ:TaxLineId>300000030937754</typ:TaxLineId>
					<typ:TaxLineNumber>1</typ:TaxLineNumber>
					<typ:TaxOnlyLineFlag>N</typ:TaxOnlyLineFlag>
					<typ:TaxPointBasis>INVOICE</typ:TaxPointBasis>
					<typ:TaxRate>6</typ:TaxRate>
					<typ:TaxRateCode>STD</typ:TaxRateCode>
					<typ:TaxRegimeCode>VERTEX COMMON TAX</typ:TaxRegimeCode>
					<typ:TaxStatusCode>STANDARD</typ:TaxStatusCode>
					<typ:TaxableAmt>100</typ:TaxableAmt>
					<typ:TaxableAmtTaxCurr>100</typ:TaxableAmtTaxCurr>
					<typ:TrxCurrencyCode>USD</typ:TrxCurrencyCode>
					<typ:TrxDate>2022-10-10</typ:TrxDate>
					<typ:TrxId>364321</typ:TrxId>
					<typ:TrxLevelType>SHIPMENT</typ:TrxLevelType>
					<typ:TrxLineId>300000030937741</typ:TrxLineId>
					<typ:UnroundedTaxAmt>6</typ:UnroundedTaxAmt>
					<typ:UnroundedTaxableAmt>100</typ:UnroundedTaxableAmt>
				</typ:trxDetailTaxLine>
			</typ:trxDetailTaxLineList>
		</typ:calculation>
	</soapenv:Body>
</soapenv:Envelope>